# GetLSN

## Description
Function GetLSN returns the line style of the referenced object.

```pascal
FUNCTION GetLSN(h : HANDLE) : LONGINT;
```

```python

def vs.GetLSN(h):
    return LONGINT
```

## Parameters
|Name|Type|Description|
|---|---|---|
|h|HANDLE|Handle to object.|

## See Also
VS Functions:
SetLSN

## Version
Availability: from Vectorworks 2013
## Category
* Object Attributes